Revit 2026 API

# WallpaintFinishType Enumeration

---

The enumerated type representing the permitted values for the asset property "WallpaintFinish" from the "WallPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WallpaintFinishType
```
```vb
Public Enumeration WallpaintFinishType
```
```cpp
public enum class WallpaintFinishType
```
```fsharp
type WallpaintFinishType
```

| Member name | Value | Description |
| --- | --- | --- |
| Eggshell | 1 |  |
| Flat | 0 |  |
| Gloss | 5 |  |
| Pearl | 3 |  |
| Platinum | 2 |  |
| Semigloss | 4 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace